{
  "auto_mapping": null,
  "base_model_name_or_path": "bigscience/bloom-1b7",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "self_attention.dense_h_to_4h",
    "self_attention.query_key_value"
  ],
  "task_type": "SEQ_CLS"
}